In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [
    {'luas': 1000, 'harga': 1000, 'kota': 'Jakarta'},
    {'luas': 2000, 'harga': 2000, 'kota': 'Jakarta'},
    {'luas': 3000, 'harga': 3000, 'kota': 'Jakarta'},
    {'luas': 4000, 'harga': 4000, 'kota': 'Jakarta'},
    {'luas': 5000, 'harga': 5000, 'kota': 'Jakarta'},
    {'luas': 1000, 'harga': 500, 'kota': 'Bogor'},
    {'luas': 2000, 'harga': 1000, 'kota': 'Bogor'},
    {'luas': 3000, 'harga': 1500, 'kota': 'Bogor'},
    {'luas': 4000, 'harga': 2000, 'kota': 'Bogor'},
    {'luas': 5000, 'harga': 2500, 'kota': 'Bogor'},
    {'luas': 1000, 'harga': 2000, 'kota': 'Tangsel'},
    {'luas': 2000, 'harga': 4000, 'kota': 'Tangsel'},
    {'luas': 3000, 'harga': 6000, 'kota': 'Tangsel'},
    {'luas': 4000, 'harga': 8000, 'kota': 'Tangsel'},
    {'luas': 5000, 'harga': 10000, 'kota': 'Tangsel'}
]
df = pd.DataFrame(data)
df

    luas  harga     kota
0   1000   1000  Jakarta
1   2000   2000  Jakarta
2   3000   3000  Jakarta
3   4000   4000  Jakarta
4   5000   5000  Jakarta
5   1000    500    Bogor
6   2000   1000    Bogor
7   3000   1500    Bogor
8   4000   2000    Bogor
9   5000   2500    Bogor
10  1000   2000  Tangsel
11  2000   4000  Tangsel
12  3000   6000  Tangsel
13  4000   8000  Tangsel
14  5000  10000  Tangsel

### 1. Dummy Var Pandas

In [3]:
dfDummy = pd.get_dummies(df['kota'])
dfDummy

    Bogor  Jakarta  Tangsel
0       0        1        0
1       0        1        0
2       0        1        0
3       0        1        0
4       0        1        0
5       1        0        0
6       1        0        0
7       1        0        0
8       1        0        0
9       1        0        0
10      0        0        1
11      0        0        1
12      0        0        1
13      0        0        1
14      0        0        1

In [4]:
dfNew = pd.concat([df, dfDummy], axis=1)
dfNew = dfNew.drop(['kota'], axis=1)
dfNew

    luas  harga  Bogor  Jakarta  Tangsel
0   1000   1000      0        1        0
1   2000   2000      0        1        0
2   3000   3000      0        1        0
3   4000   4000      0        1        0
4   5000   5000      0        1        0
5   1000    500      1        0        0
6   2000   1000      1        0        0
7   3000   1500      1        0        0
8   4000   2000      1        0        0
9   5000   2500      1        0        0
10  1000   2000      0        0        1
11  2000   4000      0        0        1
12  3000   6000      0        0        1
13  4000   8000      0        0        1
14  5000  10000      0        0        1

In [5]:
dfNew.corr()

                 luas     harga         Bogor       Jakarta   Tangsel
luas     1.000000e+00  0.623610  1.136868e-17  1.136868e-17  0.000000
harga    6.236096e-01  1.000000 -5.345225e-01 -1.336306e-01  0.668153
Bogor    1.136868e-17 -0.534522  1.000000e+00 -5.000000e-01 -0.500000
Jakarta  1.136868e-17 -0.133631 -5.000000e-01  1.000000e+00 -0.500000
Tangsel  0.000000e+00  0.668153 -5.000000e-01 -5.000000e-01  1.000000

In [6]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(dfNew[['luas','Bogor','Tangsel']], dfNew['harga'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [7]:
dfBP = model.predict(dfNew[['luas','Bogor','Tangsel']])

In [8]:
dfNew['Best Price'] = dfBP
dfNew

    luas  harga  Bogor  Jakarta  Tangsel   Best Price
0   1000   1000      0        1        0   666.666667
1   2000   2000      0        1        0  1833.333333
2   3000   3000      0        1        0  3000.000000
3   4000   4000      0        1        0  4166.666667
4   5000   5000      0        1        0  5333.333333
5   1000    500      1        0        0  -833.333333
6   2000   1000      1        0        0   333.333333
7   3000   1500      1        0        0  1500.000000
8   4000   2000      1        0        0  2666.666667
9   5000   2500      1        0        0  3833.333333
10  1000   2000      0        0        1  3666.666667
11  2000   4000      0        0        1  4833.333333
12  3000   6000      0        0        1  6000.000000
13  4000   8000      0        0        1  7166.666667
14  5000  10000      0        0        1  8333.333333

###  2. Label Encoder Sklearn

In [9]:
from sklearn.preprocessing import LabelEncoder
label = LabelEncoder()
dfUji = df
dfUji['kota'] = label.fit_transform(dfUji['kota'])
dfUji

    luas  harga  kota
0   1000   1000     1
1   2000   2000     1
2   3000   3000     1
3   4000   4000     1
4   5000   5000     1
5   1000    500     0
6   2000   1000     0
7   3000   1500     0
8   4000   2000     0
9   5000   2500     0
10  1000   2000     2
11  2000   4000     2
12  3000   6000     2
13  4000   8000     2
14  5000  10000     2

In [10]:
x = dfUji[['kota','luas']]
y = dfUji['harga']

In [11]:
model1 = LinearRegression()
model1.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [12]:
dfPrice_LE = model1.predict(x)
dfPrice_LE

array([ 1166.66666667,  2333.33333333,  3500.        ,  4666.66666667,
        5833.33333333, -1083.33333333,    83.33333333,  1250.        ,
        2416.66666667,  3583.33333333,  3416.66666667,  4583.33333333,
        5750.        ,  6916.66666667,  8083.33333333])

In [13]:
df['Best Price LE'] = dfPrice_LE
df

    luas  harga  kota  Best Price LE
0   1000   1000     1    1166.666667
1   2000   2000     1    2333.333333
2   3000   3000     1    3500.000000
3   4000   4000     1    4666.666667
4   5000   5000     1    5833.333333
5   1000    500     0   -1083.333333
6   2000   1000     0      83.333333
7   3000   1500     0    1250.000000
8   4000   2000     0    2416.666667
9   5000   2500     0    3583.333333
10  1000   2000     2    3416.666667
11  2000   4000     2    4583.333333
12  3000   6000     2    5750.000000
13  4000   8000     2    6916.666667
14  5000  10000     2    8083.333333

### 3. Label Encoder + One Hot Encoder Sklearn

In [14]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
#
ct = ColumnTransformer([('one_hot_encoder', OneHotEncoder(categories='auto'), [0])], remainder='passthrough')
a = np.array(ct.fit_transform(x), dtype=np.int64)
b = y

In [17]:
a

array([[   0,    1,    0, 1000],
       [   0,    1,    0, 2000],
       [   0,    1,    0, 3000],
       [   0,    1,    0, 4000],
       [   0,    1,    0, 5000],
       [   1,    0,    0, 1000],
       [   1,    0,    0, 2000],
       [   1,    0,    0, 3000],
       [   1,    0,    0, 4000],
       [   1,    0,    0, 5000],
       [   0,    0,    1, 1000],
       [   0,    0,    1, 2000],
       [   0,    0,    1, 3000],
       [   0,    0,    1, 4000],
       [   0,    0,    1, 5000]], dtype=int64)

In [18]:
b

0      1000
1      2000
2      3000
3      4000
4      5000
5       500
6      1000
7      1500
8      2000
9      2500
10     2000
11     4000
12     6000
13     8000
14    10000
Name: harga, dtype: int64

In [15]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
#x = np.array 2D & y = pd series
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [16]:
dfLE_OHE = model.predict(x)
df['Best Price LE_OHE'] = dfLE_OHE
df

    luas  harga  kota  Best Price LE  Best Price LE_OHE
0   1000   1000     1    1166.666667        1166.666667
1   2000   2000     1    2333.333333        2333.333333
2   3000   3000     1    3500.000000        3500.000000
3   4000   4000     1    4666.666667        4666.666667
4   5000   5000     1    5833.333333        5833.333333
5   1000    500     0   -1083.333333       -1083.333333
6   2000   1000     0      83.333333          83.333333
7   3000   1500     0    1250.000000        1250.000000
8   4000   2000     0    2416.666667        2416.666667
9   5000   2500     0    3583.333333        3583.333333
10  1000   2000     2    3416.666667        3416.666667
11  2000   4000     2    4583.333333        4583.333333
12  3000   6000     2    5750.000000        5750.000000
13  4000   8000     2    6916.666667        6916.666667
14  5000  10000     2    8083.333333        8083.333333